In [1]:
import pandas as pd
import numpy as np

In [2]:
marks = pd.read_csv("marks.csv")

In [4]:
import sqlite3

In [11]:
con = sqlite3.connect("marks.db")

In [16]:
marks.to_sql("marks",con,index=False, if_exists='replace' )

In [19]:
marks2 = pd.read_sql("select * from marks",con, index_col='Sno')

In [20]:
marks2

        Name  Java  Python  Html  Sql
Sno
101     Bill    80    77.0  90.0   70
102     Andy    81    78.0  79.0   79
103    Scott    80    78.0  97.0   78
104      Joe    81    75.0   NaN   70
105      Tom    88    77.0  89.0   77
106    Steve    89     NaN  80.0   60
107  Roberts    82    78.0  92.0   70
108     None    83    77.0   NaN   56